code/openfoam/tutorials/incompressibleVoF/DTCHullProp/system/createZonesDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      createZonesDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

propeller
{
    type        cylinder;
    zoneType    cell;

    point1      (0.18 0 0.0842);
    point2      (0.16 0 0.0842);
    radius      0.075;
}

// ************************************************************************* //
